# 近期出现的问题：
    # 笔记的书写过于详细，形式主义浓，导致效率低下
    # 笔记的书写以抄为主，缺乏自己的理解，并且记忆效果差
    # 输出少

# 改正
    # 我本身是有c语言和java基础的，在学习python时的应当提高效率
        # 一：
            # 记录关键词（非完整句子）
            # 2个问题（讲师提到的或自己产生的）
            # 1个应用场景联想（这个技术能用在哪儿？）
        # 二：
            # 复习期加工
            # 1. 速览锚点 重读3×3记录
            # 2. 框架填空
            # 3. 针对标记查资料解决1个核心疑问
            # 4. 假装教给虚拟学生（费曼技巧）
        # 三
            # 间隔实践强化
        # 四
            # 对比学习，比如对比一下python的c语言，java，c++有什么区别和关联，强化记忆

        # 不要进入逐字的抄袭模式阻碍深度思考